# ==========================================================================
# Taps (third-party package sources)
# ==========================================================================
tap "1password/tap"
tap "antoniorodr/memo"
tap "henrygd/beszel"
tap "steipete/tap"

# ==========================================================================
# CLI: shell & terminal quality-of-life
# ==========================================================================
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Render markdown on the CLI
brew "glow"
# Official tldr client written in Rust
brew "tlrc"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true

# ==========================================================================
# CLI: development tools
# ==========================================================================
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Access VS Code through the browser
brew "code-server", restart_service: :changed
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Rust toolchain installer
brew "rustup"
# Package compiler and linker metadata toolkit
brew "pkgconf"

# ==========================================================================
# CLI: Python toolchain
# ==========================================================================
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Bash completion for Pip
brew "pip-completion"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python virtualenv extensions
brew "virtualenvwrapper"

# ==========================================================================
# CLI: networking & remote access
# ==========================================================================
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# High-performance authoritative-only DNS server
brew "knot"
# Securely transfers data between computers
brew "magic-wormhole"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Implements SNMP v1, v2c, and v3, using IPv4 and IPv6
brew "net-snmp"
# Port scanning utility for large networks
brew "nmap"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"

# ==========================================================================
# CLI: libraries & misc
# ==========================================================================
# Core application library for C
brew "glib"
# Library for USB device access
brew "libusb"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Mac App Store command-line interface
brew "mas"
# CLI and dbus interface for WhisperSystems/libsignal-service-java
brew "signal-cli"
# Multi-modal AI tool to extract and summarize content
brew "summarize"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"

# ==========================================================================
# CLI: from third-party taps (require `brew trust`, see README)
# ==========================================================================
# CLI to manage Apple Notes and Reminders from the terminal
brew "antoniorodr/memo/memo"
# Agent for the Beszel lightweight server monitoring platform
brew "henrygd/beszel/beszel-agent"
# Send and read iMessages from the command-line
brew "steipete/tap/imsg"
# macOS screenshot and automation tool
brew "steipete/tap/peekaboo"
# Manage Apple Reminders from the command-line
brew "steipete/tap/remindctl"

# ==========================================================================
# Apps: passwords & security
# ==========================================================================
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Desktop client for Proton Pass
cask "proton-pass"
# Application for configuring any YubiKey
cask "yubico-authenticator"

# ==========================================================================
# Apps: browsers
# ==========================================================================
# Chromium based browser
cask "arc"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"

# ==========================================================================
# Apps: AI assistants
# ==========================================================================
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"

# ==========================================================================
# Apps: development
# ==========================================================================
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Collaboration platform for API development
cask "postman"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"

# ==========================================================================
# Apps: virtualization & remote desktop
# ==========================================================================
# Desktop virtualization software
cask "parallels"
# Connect to virtual machines using SPICE
cask "remoteviewer"
# Virtual machines UI using QEMU
cask "utm"
# Open-source version of the X.Org X Window System
cask "xquartz"

# ==========================================================================
# Apps: networking
# ==========================================================================
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Network protocol analyzer
cask "wireshark-app"

# ==========================================================================
# Apps: productivity & communication
# ==========================================================================
# Note editor and whiteboard
cask "affine"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# App to write, plan, collaborate, and get organised
cask "notion"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Meet
cask "proton-meet"

# ==========================================================================
# Apps: hardware, imaging & 3D printing
# ==========================================================================
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Software for Logitech devices
cask "logi-options+"
# Programmable solid 3D CAD modeller
cask "openscad@snapshot"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"

# ==========================================================================
# Mac App Store: Safari extensions
# ==========================================================================
mas "1Password for Safari", id: 1569813296
mas "Keeper for Safari", id: 6444685332
mas "Keyword Search", id: 1558453954
mas "Noir", id: 1592917505
mas "Privacy.com for Safari", id: 6449850851
mas "Proton Pass for Safari", id: 6502835663

# ==========================================================================
# Mac App Store: Apple & productivity
# ==========================================================================
mas "Apple Configurator", id: 1037126344
mas "Developer", id: 640199958
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

# ==========================================================================
# Mac App Store: networking, homelab & remote access
# ==========================================================================
mas "Bridge Control", id: 1632237342
mas "Discovery", id: 1381004916
mas "EasyMQTT", id: 1523099606
mas "Home Assistant", id: 1099568401
mas "MQTT Explorer", id: 1455214828
mas "Screens 5", id: 1663047912
mas "ShellFish", id: 1336634154
mas "Speedtest", id: 1153157709
mas "WireGuard", id: 1451685025

# ==========================================================================
# Mac App Store: utilities & misc
# ==========================================================================
mas "BetterSnapTool", id: 417375580
mas "Okta Verify", id: 490179405
mas "Shortery", id: 1594183810
mas "SQLPro Studio", id: 985614903
mas "Steam Link", id: 1246969117
